** DATA MUNGING ADDENDUM: THE LONG WAY TO HANDLE COMMA DELIMITED LISTS

** OCTOBER 10, 2016 GEOFF BOUSHEY

In an earlier post, we discussed the issue of comma delimited lists within an excel spreadsheet. This way of one-to-many relationships in data can make it more difficult to build look up tables, run queries, and do other types of analysis. Although there are some concise coding approaches, both in SQL and pandas, sometimes you just want to [give up on trying to be clever and] reconstruct your data frame line by line. Hereâ€™s a quick overview on how to do this.

In [14]:
import pandas as pd
import numpy as np

In [18]:
df = pd.DataFrame({'A' : [1,2,3,4,5], 
                   'B' : [2,3,4,5,6],
                   'C' : ['one','two','three','four','five']})

In [19]:
df

   A  B      C
0  1  2    one
1  2  3    two
2  3  4  three
3  4  5   four
4  5  6   five

In [25]:
ar1 = [1,2,3,4,5]
ar2 = [2,4,6,8,10]
ar3 = ['one','two,three,four','three,four,five','four,five','five']

In [26]:
df = pd.DataFrame({'A' : ar1, 'B' : ar2, 'C' : ar3})

In [27]:
df

   A   B                C
0  1   2              one
1  2   4   two,three,four
2  3   6  three,four,five
3  4   8        four,five
4  5  10             five

In [56]:
a0 = []
a1 = []
a2 = []

for index, row in df.iterrows():
    for s in row[2].split(','):
        a0.append(row[0])
        a1.append(row[1])
        a2.append(s)

In [57]:
ndf = pd.DataFrame({'A' : a0, 'B' : a1, 'C' : a2})

In [58]:
ndf

   A   B      C
0  1   2    one
1  2   4    two
2  2   4  three
3  2   4   four
4  3   6  three
5  3   6   four
6  3   6   five
7  4   8   four
8  4   8   five
9  5  10   five

In [59]:
df

   A   B                C
0  1   2              one
1  2   4   two,three,four
2  3   6  three,four,five
3  4   8        four,five
4  5  10             five

In [60]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [61]:
pysqldf("SELECT * FROM df WHERE A = 3")

   A  B                C
0  3  6  three,four,five

In [62]:
pysqldf("SELECT * FROM ndf WHERE A = 3")

   A  B      C
0  3  6  three
1  3  6   four
2  3  6   five